package ljh;

public class Homework0711 {
/*
	1. 자바에서 상속에 대해서 정리해 서술 해주세요.
	
	부모클래스와 자식 클래스가 있을경우 자식 클래스가 extends를 통해 부모클래스를 상속받는다.
	이 경우, 자식의 클래스는 부모 클래스의 특징을 가지고 있고,자식클래스만의 특징도 가지고 있으므로
	기능적으로는 자식의 클래스가 더 많다고 할 수 있다.
	또한 부모의 메소드를 그대로 물려받을 수 있다.
	그렇지만 부모의 클래스가 자식의 클래스 보다 상위클래스이다.
	이러한 특성으로 자식클래스는 부모클래스이 필드와 메소드를 구현할 필요없이 사용가능한다.
	
	
	2. 오버로딩에 대해서 정리하여 서술해주세요.
	
	하나의 클래스에서 인자가 다르면 생성자를 여러개 만들 수 있는데 이것을 오버로딩이라고한다.
        이 경우, 문장이 완전히 똑같지 않는 경우를 제외하면 순서나 갯수, 타입에 상관없이 가능하다.
	
	3. 오버라이딩에 대해서 정리하여 서술해주세요.
	
	부모의 동일한 메소드를 자식클래스에서 다시 정의하는것을 오버라이딩이라고한다.
	이는 부모의 특성을 수정 보완을 하는데 도움이된다.

	
	4. 생성자와 메서드와 차이점에 대해 정리하여 서술해주세요.	
	
	첫번째 차이점은 앞에 void, int, String과 같이 데이터 타입이 있으면 메서드이고
         데이터 타입이 없고  클래스 이름과 같다면 생성자이다.
	이때 생성자는 반드시 클래스이름과 같아야한다. 필요시 인자를 적을 수 있다.
	두번째 차이점은 역할인데 생성자의 경우 초기 값을 저장할 수 있으며, 가장 먼저 실행한다.
	세번째 차이점은 메서드는 반환형을 기술하며, 메서드는 기술하지 않는다.

	
	
	
*/	
	

}
