package jds;

public class Java {
//자바의 특성에 대해 서술 하시오
//	1.캡슐화와 데이터 은닉 : 자바의 객체 내부가 어떤식으로 구성되어 있는지 모르고 어떤 메서드를 사용하면 원
//	하는 데이터 값을 얻을수 있다.
//	즉 구체적인 내용은 몰라도 원하는 결과를 얻어 낼수 있기에 코딩하는데 있어서 수월하다
//	객체 외부에서 데이터를 직접 건들면 데이터가 변환될 수 있기 때문에 변환을 막기 위해서 데이터 은닉이라는 개념이 존재한다.
//	캡슐화와 데이터 은닉은 접근지정자를 사용하여 구현한다.
//	2. 다향성과 메소드의 오버로딩
//	다향성은 이름이 동일한 메소드가 어떠한 자료로 사용되는지에 따라 다르게 동작한다.
//	자바에서 메소드의 이름으로 전달인자의 자료형이나 개수를 서로 다르게 주어 같은 메소드 이름으로 여러번 정의할수 있다.
//	이렇게 동일한 이름의 메소드를 여러번 정의 하는 것을 메소드의 오버로딩이라 한다.
//	3. 상속성
//	객체지향의 가장 대표적인 특이이다. 특성 객체의 성격을 다른 객체가 상속 받아 사용할수 있도록 하는것 
//	클래스를 설계할 때 공통적으로 필요한 성격들을 기본적인 클래스에 정의해 두면 다른 클래스를 작성할때 공통적인
//	내용은 클래스에서 상속 받아 사용할 수있다.
}
