package chi;

public class Test {
//	1. 자바에서 상속에 대해서 정리해 서술 해주세요.
	//프로그램을 쉽게 확장 해 줄수 있도록 해주는 수단
	//클래스를 계층적으로 체계화
	//기존의클래스로부터 확장이 용이
	//공통의특성을 하위클래스마다 반복적으로 기술하지않고 한번만 기술하기 때문에
	//중복을 줄여 재사용 효과
	//152p 153p 절대 자바
	//2. 오버로딩에 대해서 정리하여 서술해주세요.
	//	클래스 내부에서 인자가 다르나 이름이 같은 메소드가 여러개 정의 될수 있는 특징
	//반환값이나 지정자가 다르더라도 인자가 같으면 더이상 동일한 이름으로 메소드를 만들수없다.
	//222p 절대 자바
	//3.오버라이딩에 대해서 정리하여 서술해주세요.
	//상위 클래스의 동일한 메소드를 하위 클래스에서 다시 정의하는 것
	//목적:상위클래스에서 이미 정의한 메소드를 다시 수정하지않고 하위클래스에서 좀더 보완수정하거나 완전히 새로운 것으로 대체하기 위한 방법
	//	조건:1.메소드의 반환값과메소드 이름,매개변수는 반드시 같어야 한다.
	//2.접근 지정자는 하위클래스의 메소드가 보다 공개적이어야 한다.
	//3.메소드 수정자가 final, private인 메소드는 오버라이딩이 될 수 없다.
	//216p~218p 절대 자바

	//4.생성자(메모리 )와 메서드와 차이점에 대해 정리하여 서술해주세요.
	//일반 메소드는 반환형을 반드시 기술하며, 생성자는 반환형을 기술하지 않는다는것이 메소드와 생성자의 다른점이다.
	//164p 절대 자바
	//	절대 자바
}
