/*package hell;

public class JavaNotion {
	
	 * 1. 자바에서 상속에 대해서 정리해 서술 해주세요. 자바에 상속이란 father > son 라고 할수 있습니다. 간단한 예시로는 자동차 >
	 * 그랜져,아반떼,산타페... 라는 이 예시를 보면 그랜져 아반떼 산타페 라는 차종은 자동차라는 그룹에 포함되어 있습니다. 이 경우를 자바에서
	 * 표현한다면 public class Car 자동차 라는 클래스를 선언합니다! public class Granger extends Car
	 * 그리고 그랜져라는 클래스에 extends(상속)을 쓰면 Granger는 Car에 상속 됩니다. 상속에 대한
	 * 특징으로는
	 * 다중상속이 불가능 합니다. (예를 들면 Granger라는 클래스에 public class Granger extends Car
	 * extends 대형차 이런식으로 안됩니다
	 * 
	 * 
	 * 
	 * 2. 오버로딩에 대해서 정리하여 서술해주세요. 오버로딩이란 메소드를 이름은 같지만 변수를 다르게 가지고 있는 메소드를 생성합니다. ex)
	 * public String test() { 
	 * return null; 
	 * } 
	 * public String test(int a) 
	 * { return null; 
	 * } public String test(String a) {
	 *  return null; 
	 *  }
	 *  ex) 수박(빨간! 씨없는) 수박(노란! 씨있는) 요런 느낌? 더 헷갈릴꺼같기도;
	 *  오버로딩으로 여러가지를 만들었습니다. 클래스가 오버로딩된 상태에서 정확하게 무언가를 호출할려면
	 * this라는것으로 코드 중복을 줄일때 사용합니다.
	 * 
	 * 3. 오버라이딩(overriding)에 대해서 정리하여 서술해주세요. 상속된 상태에서 상위클래스와 하위클래스 [메소드, 이름, 반환형,
	 * 매개변수,입력순서] 모두 같아야 합니다. (메소드의 서명 = 매개변수의 데이터 타입,개수,입력순서)
	 * 오버라이딩 재정의 = 그 상위 클래스의 메소드를 수정한다 = 오버라이딩을 하게 되면 상위 클래스에서 정의 되었던 메소드는 무시가 된다.(인스턴스 내에서만)
	 * 
	 * 구분            오버로딩  오버라이딩
	 * 메소드 이름       동일        동일
	 * 매개변수, 타입    다름        동일
	 * 리턴 타입        상관없음     동일
	 * 
	 * 4. 생성자와 메서드와 차이점에 대해 정리하여 서술해주세요.  
	 *  
        생성자는 리턴타입을 정의하지 않는다. 매개변수에 따라서 여러 개를 만들 수 있다
          생성자를 프로그래머가 만들지 않으면 매개변수가 없는 생성자가 컴파일할 때 자동으로 만들어진다.
          매개변수가 없는 생성자를 기본생성자라고 한다.
        (남에거 봐도 이해가 안가네요 마지막껀 못하겠어요....)
	 * 
	 * 
	 * d
	 
}
*/