package kmw;

public class HomeWork_2018_07_11 {
	
	/*1. 자바에서 상속에 대해서 정리해 서술 해주세요.
	상속이란. 다른 클래스가 가진 멤버변수나 메소드같은 내용들을 그대로 읽어와
	  
	읽어온 클래스에서 상위클래스의 내용들을 다시 만들지 않아도 그 내용들을 사용 할 수 있게 하는 방법.
	 
	 
	 
	2. 오버로딩에 대해서 정리하여 서술해주세요.
	
	동일한 이름의 메소드를 파라미터만 변경해서 여러개 사용할 수 있게하는 것.
	
	예)  void god(){
			System.out.println("") 
		  }
		  void god(int a){
			System.out.println("")
		  }		
		  void god(String a){
			System.out.println("")
		  }
	
	
	
	3. 오버라이딩에 대해서 정리하여 서술해주세요.
		부모 클래스에서 정의해놓은 메소드를 가져와서 사용을 하지만
		그 메소드의 원래의 기능을 내맘대로 바꾸어
		원래 A라는 기능을 하는 메소드였다면 지금 클래스에선 
		B라는 기능으로 동작하게 하는 방법.
		예)
		class test {
		    void t() {
		    A
		    }
		}
		
		class test2 extends test{
		 void t() {
		     B
		     }
	     }
	
	4. 생성자와 메서드와 차이점에 대해 정리하여 서술해주세요.
	  가장 큰차이는 메소드는 메소드 명을 자유자재로 정해 만들 수 있지만
	  생성자는 클래스명과 완전히 대소문자 까지 동일하게 해야만 만들 수 있음.
	  
	  또, 사용 방식인데. 메소드같은경우 해당 클래스를 불러와서 그 클래스의 메소드 명을 기재해서 작동하는 방식이지만
	  생성자는 해당 클래스를 불러오는 동시에 작동되어버리기때문에 생성자는 생성시에만 사용이 가능함.
	  예) 메소드
	    Class c = new Class();
	    c.start();    이렇게 작동
	    
	    생성자
	    Class c = new Class(); 이러면 바로작동
	
	
	
	

	
	
	
*/
}
